In [7]:
import numpy as np
import pandas as pd

In [8]:
# Níveis de Índice
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [9]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [10]:
inside

[1, 2, 3, 1, 2, 3]

In [19]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=['A', 'B'])

In [14]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [20]:
df

             A         B
G1 1 -0.545687  0.037090
   2  0.435995 -0.398380
   3  0.951561 -0.491298
G2 1 -0.068940 -0.775637
   2 -1.082656 -0.990120
   3 -0.632859  1.136987

In [36]:
df.loc['G1']

               A         B
Numero
1      -0.545687  0.037090
2       0.435995 -0.398380
3       0.951561 -0.491298

In [23]:
df.loc['G1'].loc[1]

A   -0.545687
B    0.037090
Name: 1, dtype: float64

In [38]:
df.index.names = ['Grupo','Numero']

In [39]:
df

                     A         B
Grupo Numero
G1    1      -0.545687  0.037090
      2       0.435995 -0.398380
      3       0.951561 -0.491298
G2    1      -0.068940 -0.775637
      2      -1.082656 -0.990120
      3      -0.632859  1.136987

In [37]:
df.xs('G1')

               A         B
Numero
1      -0.545687  0.037090
2       0.435995 -0.398380
3       0.951561 -0.491298

In [40]:
df.xs(1, level = 'Numero')

              A         B
Grupo
G1    -0.545687  0.037090
G2    -0.068940 -0.775637

In [41]:
d = {'A': [1, 2, np.nan], 'B':[5, np.nan, np.nan],'C':[1, 2, 3]}

In [42]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [43]:
df1 = pd.DataFrame(d)

In [44]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [47]:
df1.dropna()

     A    B  C
0  1.0  5.0  1

In [48]:
df1.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [51]:
df1.fillna(value='Ausente')

         A        B  C
0      1.0      5.0  1
1      2.0  Ausente  2
2  Ausente  Ausente  3

In [53]:
df1.fillna(value=df1['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [55]:
df1.fillna(method='ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

GroupBy

In [ ]:
# Cria um DataFrame

In [56]:
data = {'Empresa':['GOOG','GOOG', 'MSFT','MSFT','FB','FB'],
        'Nome':['Sam', 'Charlie','Amy', 'Vanessa', 'Carl','Sarah'],
        'Venda':[200,120,340,124,243,350]}

In [58]:
df2 = pd.DataFrame(data)

In [60]:
df2

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [62]:
group = df2.groupby('Empresa')

In [63]:
group

In [64]:
group.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [65]:
group.mean()

         Venda
Empresa
FB       296.5
GOOG     160.0
MSFT     232.0

In [66]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [67]:
group.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [69]:
group = df2.groupby('Nome')

In [71]:
group.sum()

         Venda
Nome
Amy        340
Carl       243
Charlie    120
Sam        200
Sarah      350
Vanessa    124

In [72]:
group.sum().loc['Sarah']

Venda    350
Name: Sarah, dtype: int64

In [73]:
group.sum().loc['Carl']

Venda    243
Name: Carl, dtype: int64

Importante!!!